# ExternalResourceUtils Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalResourceUtils Members
ExternalResourceUtils Class Methods See Also
---
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetAllExternalResourceReferences(Document) | Gets the ids of all elements which refer to external resources. |
| GetAllExternalResourceReferences(Document, ExternalResourceType) | Gets the ids of all elements which refer to a specific type of external resource. |

# See Also
ExternalResourceUtils Class
Autodesk.Revit.DB Namespace